{
    "projects": [
      {
        "id": "jubileeAusten",
        "name": "Jubilee Austen Portfolio",
        "imgSrc": "../img/html-css/jubilee-austen.png",
        "imgAlt": "Jubilee Austen Portfolio Image",
        "skills": "CSS3, Flexbox, HTML5, Media Queries, Responsive Typography, Version Control",
        "tools": "Adobe Photoshop, GitHub, Visual Studio Code",
        "description": "Using HTML and CSS, I created a responsive portfolio website. This was a project I completed through Skillcrush, an online coding program. I used a Photoshop design comp to extract font styles, colors and measurements to replicate the design in CSS, while using HTML to structure the content. I wrote all of the code in Visual Studio Code.",
        "code": "https://github.com/madelinekreiff/jubilee-austen",
        "url": "https://madelinekreiff.github.io/jubilee-austen/",
        "react": "no"
      },
  
      {
        "id": "unpluggedRetreat",
        "name": "Unplugged Retreat",
        "imgSrc": "../img/html-css/unplugged-retreat.png",
        "imgAlt": "Unplugged Retreat Image",
        "skills": "CSS3, Flexbox, HTML5, Media Queries, Responsive Typography, Version Control",
        "tools": "Adobe Photoshop, GitHub, Visual Studio Code",
        "description": "Unplugged Retreat is a website for a business that provides company retreat services. This was the first project where I challenged myself to create this website project on my own with no hints or guidance through Skillcrush's course. I used a Photoshop design comp to determine specific fonts, spacing, and colors. When developing this website, I used a Mobile First design process to create a responsive web page for any browsing device. There are breakpoints in the CSS code for tablet and desktop widths and flexbox styles for an easy yet efficient layout.",
        "code": "https://github.com/madelinekreiff/unplugged-retreat",
        "url": "https://madelinekreiff.github.io/unplugged-retreat/",
        "react": "no"
      },
    
      {
        "id": "roguePickings",
        "name": "Rogue Pickings Restaurant",
        "imgSrc": "../img/html-css/rogue-pickings.png",
        "imgAlt": "Rogue Pickings Restaurant Image",
        "skills": "CSS3, Flexbox, HTML5, Media Queries, Responsive Typography, Version Control",
        "tools": "Adobe Photoshop, GitHub, Visual Studio Code",
        "description": "This is another Skillcrush project where I used Visual Studio Code and a Photoshop design comp to create a website for a restaurant. It included an About & Contact section, Menu, Customer Reviews and a link to its location on Google Maps. This project focused heavily on structuring navigation bars and links in HTML and styling them in CSS, which I was able to master.",
        "code": "https://github.com/madelinekreiff/rogue-pickings",
        "url": "https://madelinekreiff.github.io/rogue-pickings/",
        "react": "no"
      },
    
      {
        "id": "recipeCard",
        "name": "Recipe Cards",
        "imgSrc": "../img/html-css/recipe-card.png",
        "imgAlt": "Recipe Cards Image",
        "skills": "CSS3, Flexbox, HTML5, Media Queries, Responsive Typography, Version Control",
        "tools": "GitHub, Visual Studio Code",
        "description": "In this Skillcrush project, I used CSS to style the provided HTML content in Visual Studio Code. There was no design comp, so I estimated the measurements by hand and was given a style guide to refer back to with the required fonts and colors. The main goal was to learn and practice additional complex CSS styles to create a clean layout.",
        "code": "https://github.com/madelinekreiff/recipe-card",
        "url": "https://madelinekreiff.github.io/recipe-card/",
        "react": "no"
      },
  
      {
        "id": "electionMap",
        "name": "Election Map",
        "imgSrc": "../img/javascript/election-map.png",
        "imgAlt": "Election Map Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Created a dynamic map of the U.S. with results of an imaginary election. Election results from each state are dynamically changed in a table when the mouse moves over each state on the map. Using JavaScript, I mastered writing functions, loops, and array operations while accessing the DOM to connect JavaScript to the visual HTML.",
        "code": "https://github.com/madelinekreiff/election-map",
        "url": "https://madelinekreiff.github.io/election-map/",
        "react": "no"
      },
  
      {
        "id": "githubRepo",
        "name": "GitHub Repo Gallery",
        "imgSrc": "../img/javascript/github-repo-gallery.png",
        "imgAlt": "GitHub Repo Gallery Image",
        "skills": "APIs, JavaScript, Manipulating the DOM",
        "tools": "GitHub, Visual Studio Code",
        "description": "Used JavaScript and the GitHub API to fetch my GitHub profile and create a gallery of repos and their descriptions. Created a dynamic search bar to filter through repos and make searching easier. This project was the inspiration for the portfolio section of my website that you are currently on! It utilizes JavaScript async functions to connect to an API, as well as event handlers and listeners to interact with the DOM. I also learned how to remove and add CSS classes through JavaScript.",
        "code": "https://github.com/madelinekreiff/github-repo-gallery",
        "url": "https://madelinekreiff.github.io/github-repo-gallery/",
        "react": "no"
      },
  
      {
        "id": "guessTheWord",
        "name": "Guess the Word",
        "imgSrc": "../img/javascript/guess-the-word.png",
        "imgAlt": "Guess the Word Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Used JavaScript to program an interactive computer game by accessing the DOM to create event listeners and functions, as well as use loops and conditional statements. Want to play the game? Check out the link below!",
        "code": "https://github.com/madelinekreiff/guess-the-word",
        "url": "https://madelinekreiff.github.io/guess-the-word/",
        "react": "no"
      },
  
      {
        "id": "drumkit",
        "name": "Drumkit",
        "imgSrc": "../img/javascript/drumkit.png",
        "imgAlt": "Drumkit Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Interacted with the DOM in JavaScript to create a keydown event that plays a specific audio from a drum set when a corresponding key is pressed. Feel free to check it out yourself!",
        "code": "https://github.com/madelinekreiff/js30-drumkit01",
        "url": "https://madelinekreiff.github.io/js30-drumkit01/",
        "react": "no"
      },
  
      {
        "id": "clock",
        "name": "Clock",
        "imgSrc": "../img/javascript/clock.png",
        "imgAlt": "Clock Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Created an automatic analog clock that tracks the current time at all hours through JavaScript functions. I used conditional statements, hand written functions, and built in time functions to do so. I became familiar with using JavaScript to update CSS styles.",
        "code": "https://github.com/madelinekreiff/js30-clock02",
        "url": "https://madelinekreiff.github.io/js30-clock02/",
        "react": "no"
      },
  
      {
        "id": "cssVariables",
        "name": "Updating CSS Variables",
        "imgSrc": "../img/javascript/css-variables.png",
        "imgAlt": "Updating CSS Variables Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Used JavaScript to access the DOM elements with event listeners to change the CSS styles of an image such as spacing, blurring, and background color based on input from a sliding bar range. I used event listeners and handlers to listen for the sliding bar being moved, which then resulted in a CSS style being changed. Go ahead and try it out yourself!",
        "code": "https://github.com/madelinekreiff/js30-css-variables03",
        "url": "https://madelinekreiff.github.io/js30-css-variables03/",
        "react": "no"
      },
  
      {
        "id": "flexPanels",
        "name": "Flex Panel Gallery",
        "imgSrc": "../img/javascript/flex-panels.png",
        "imgAlt": "Flex Panel Gallery Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Implemented CSS classes with flex and transform styles, which were then used in JavaScript event listeners to toggle on and off. The classes transition in and out based on a cubic bezier. Click on each panel on the web page and see what happens!",
        "code": "https://github.com/madelinekreiff/js30-flex-panel-gallery05",
        "url": "https://madelinekreiff.github.io/js30-flex-panel-gallery05/",
        "react": "no"
      },
  
      {
        "id": "typeAhead",
        "name": "Type Ahead Search Bar",
        "imgSrc": "../img/javascript/type-ahead.png",
        "imgAlt": "Type Ahead Search Bar Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Using JavaScript, created a dynamic search box for a list of cities and their corresponding states and populations. Searches created a regular expression which were used to find and display matches. I used async functions to fetch the data from an API and used objects and arrays to hold the desired data. An event handler is triggered every time a key is typed into the search bar to update the results. Feel free to check it out for yourself!",
        "code": "https://github.com/madelinekreiff/js30-type-ahead06",
        "url": "https://madelinekreiff.github.io/js30-type-ahead06/",
        "react": "no"
      },
  
      {
        "id": "html5Canvas",
        "name": "HTML5 Canvas",
        "imgSrc": "../img/javascript/html5-canvas.png",
        "imgAlt": "HTML5 Canvas Image",
        "skills": "JavaScript",
        "tools": "GitHub, Visual Studio Code",
        "description": "Used HTML5 canvas and JavaScript to create a tool that draws rainbow lines as the mouse drags across the page. Worked with .getContext() and different attributes to change stroke styles and colors. I learned a lot of new features from this project from changing the hue and line width based on conditional statements. I also learned about mousedown, mouseup and mousemove event listeners which together is what creates the dragging motion on a mousepad. Channel your inner artist skills by using your mouse to click and drag! (As of right now, this project only works on a desktop with a mouse)",
        "code": "https://github.com/madelinekreiff/js30-html5-canvas08",
        "url": "https://madelinekreiff.github.io/js30-html5-canvas08/",
        "react": "no"
      },
  
      {
        "id": "stickyNotes",
        "name": "Sticky Notes App",
        "imgSrc": "../img/react/sticky-notes.png",
        "imgAlt": "Sticky Notes App Image",
        "skills": "ES6, JSX, Managing data flow, Manipulating the DOM, React",
        "tools": "CodeSandbox",
        "description": "This greenfield project allowed me to explore React components (stateful and functional). I got a lot of practice in using props to transfer certain information over to different components. By learning how to use React libraries to render specific JSX, I created a Sticky Notes App to create, edit, and search notes. This app also will retain all of your previous notes if you refresh the page. Check it out below!",
        "code": "https://codesandbox.io/s/react-sticky-notes-9-d9r29",
        "url": "https://d9r29.csb.app/",
        "react": "yes"
      },
  
      {
        "id": "hotelsFilter",
        "name": "Hotels Filter Website",
        "imgSrc": "../img/react/hotels-filter.png",
        "imgAlt": "Hotels Filter Website Image",
        "skills": "ES6, JSX, Managing data flow, Manipulating the DOM, React",
        "tools": "CodeSandbox",
        "description": "In this project, I updated functional components from provided React code to make them stateful. This website works just as any other hotel booking website would. Search results can be filtered by the Filter By bar on the side. The use of props was very handy in this challenge. I was also able to master updating the state of the data models that were created to render the proper JSX.",
        "code": "https://codesandbox.io/s/stateful-hotel-filters07-3-vhkzc",
        "url": "https://vhkzc.csb.app/",
        "react": "yes"
      },
  
      {
        "id": "nameTag",
        "name": "Name Tag Generator",
        "imgSrc": "../img/react/name-tag-generator.png",
        "imgAlt": "Name Tag Generator Image",
        "skills": "ES6, JSX, Managing data flow, Manipulating the DOM, React",
        "tools": "CodeSandbox",
        "description": "Using stateful compoennts in the React library, I updated the state of the data models to render specific JSX. This name tag generator cretes a name tag for any name you enter into the box! I mastered the skill of creating methods within components that act as event handlers when called through event listeners. By using props and having separate components for each distinctive JSX code, I was able to create clean, efficient and most importantly reusable code. I made these important changes to provided React code.",
        "code": "https://codesandbox.io/s/name-tag-generator09-2-kblbx",
        "url": "https://kblbx.csb.app/",
        "react": "yes"
      },
  
      {
        "id": "colorPalette",
        "name": "Create your own Color Palette",
        "imgSrc": "../img/react/color-palette.png",
        "imgAlt": "Create your own Color Palette Image",
        "skills": "ES6, Functional & presentational components, JSX, React",
        "tools": "CodeSandbox",
        "description": "This app allows you to create your own color palette by clicking the heart icon that appears as your mouse hovers over a selected color. This project's goal was to explore the difference between presentational and functional components. By updating provided React code, I got to see firsthand how presentational components focus on the visual aspect of a website (usually through functional components), whereas container components focus on the layout of the visual aspects (usually through stateful components).",
        "code": "https://codesandbox.io/s/presentational-components11-1-3hntg",
        "url": "https://3hntg.csb.app/",
        "react": "yes"
      }
    ]
  }